trade_exp/src/Catalogs/ВидыИспользованияРабочегоВремени/ВидыИспользованияРабочегоВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="f1ae8166-42dc-403e-ade4-33ff8c5ffa11">
  <name>ВидыИспользованияРабочегоВремени</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="acc6c5fc-ea40-49c7-9b95-fe321dacfb63">
    <name>БуквенныйКод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="904b8764-68fa-4dd2-8318-95808836ba08">
    <name>ЦифровойКод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>2</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="866fd3b2-5c64-4822-bc8a-f5902da85af3">
    <name>ПолноеНаименование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="093c6e04-2aaa-4ec1-bf43-6fd223d6057c">
    <name>РабочееВремя</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0c290f0b-3296-4cb7-b939-8c081eb041f1">
    <name>Целосменное</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="776c8fac-946b-4b5e-8e15-791244877470">
    <name>Сотрировка</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Catalog>

trade_exp/src/Catalogs/ВидыИспользованияРабочегоВремени/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	
	// Процедура заполняет справочник показателей т.н. псевдопредопределенными элементами, 
	// идентифицируемыми из кода
	//
	Процедура СоздатьВидыИспользованияРабочегоВремениПоНастройкам() Экспорт
		Если РольДоступна("ПолныеПрава") Тогда
			// Установка реквизитов предопределенных элементов
			
			ОписаниеВидаВремени = СоздатьОписаниеВидаВремени();
			ОписаниеВидаВремени.ИмяПредопределенныхДанных = "Явка";
			// Строка не локализуется т.к. является частью регламентированной формы, применяемой в РФ
			ОписаниеВидаВремени.Наименование = "Явка";
			ОписаниеВидаВремени.БуквенныйКод = "Я";
			ОписаниеВидаВремени.ЦифровойКод = "01";
			ОписаниеВидаВремени.ПолноеНаименование = НСтр("ru = 'Продолжительность работы в дневное время'");
			ОписаниеВидаВремени.РабочееВремя = Истина;
			ОписаниеВидаВремени.Целосменное = Ложь;
			
			НовыйВидИспользованияРабочегоВремени(ОписаниеВидаВремени); 
			
			ОписаниеВидаВремени = СоздатьОписаниеВидаВремени();
			ОписаниеВидаВремени.ИмяПредопределенныхДанных = "ВыполнениеГосударственныхОбязанностей";
			// Строка не локализуется т.к. является частью регламентированной формы, применяемой в РФ
			ОписаниеВидаВремени.Наименование = "Выполнение государственных обязанностей";
			ОписаниеВидаВремени.БуквенныйКод = "Г";
			ОписаниеВидаВремени.ЦифровойКод = "23";
			ОписаниеВидаВремени.ПолноеНаименование = НСтр("ru = 'Выполнение государственных обязанностей'");
			ОписаниеВидаВремени.РабочееВремя = Истина;
			ОписаниеВидаВремени.Целосменное = Ложь;
			
			НовыйВидИспользованияРабочегоВремени(ОписаниеВидаВремени);
			
			ОписаниеВидаВремени = СоздатьОписаниеВидаВремени();
			ОписаниеВидаВремени.ИмяПредопределенныхДанных = "ДополнительныеВыходныеДниНеоплачиваемые";
			// Строка не локализуется т.к. является частью регламентированной формы, применяемой в РФ
			ОписаниеВидаВремени.Наименование = "Дополнительные выходные дни (неоплачиваемые)";
			ОписаниеВидаВремени.БуквенныйКод = "НВ";
			ОписаниеВидаВремени.ЦифровойКод = "28";
			ОписаниеВидаВремени.ПолноеНаименование = НСтр("ru = 'Дополнительные выходные дни (неоплачиваемые)'");
			ОписаниеВидаВремени.РабочееВремя = Истина;
			ОписаниеВидаВремени.Целосменное = Ложь;
			
			НовыйВидИспользованияРабочегоВремени(ОписаниеВидаВремени);
			
			ОписаниеВидаВремени = СоздатьОписаниеВидаВремени();
			ОписаниеВидаВремени.ИмяПредопределенныхДанных = "Командировка";
			// Строка не локализуется т.к. является частью регламентированной формы, применяемой в РФ
			ОписаниеВидаВремени.Наименование = "Командировка";
			ОписаниеВидаВремени.БуквенныйКод = "К";
			ОписаниеВидаВремени.ЦифровойКод = "06";
			ОписаниеВидаВремени.ПолноеНаименование = НСтр("ru = 'Служебная командировка'");
			ОписаниеВидаВремени.РабочееВремя = Ложь;
			ОписаниеВидаВремени.Целосменное = Ложь;
			
			НовыйВидИспользованияРабочегоВремени(ОписаниеВидаВремени);
			
			ОписаниеВидаВремени = СоздатьОписаниеВидаВремени();
			ОписаниеВидаВремени.ИмяПредопределенныхДанных = "Отпуск";
			// Строка не локализуется т.к. является частью регламентированной формы, применяемой в РФ
			ОписаниеВидаВремени.Наименование = "Отпуск";
			ОписаниеВидаВремени.БуквенныйКод = "ОТ";
			ОписаниеВидаВремени.ЦифровойКод = "09";
			ОписаниеВидаВремени.ПолноеНаименование = НСтр("ru = 'Отпуск'");
			ОписаниеВидаВремени.РабочееВремя = Ложь;
			ОписаниеВидаВремени.Целосменное = Истина;
			
			НовыйВидИспользованияРабочегоВремени(ОписаниеВидаВремени);
			
			ОписаниеВидаВремени = СоздатьОписаниеВидаВремени();
			ОписаниеВидаВремени.ИмяПредопределенныхДанных = "ДополнительныйОтпуск";
			// Строка не локализуется т.к. является частью регламентированной формы, применяемой в РФ
			ОписаниеВидаВремени.Наименование = "Дополнительный отпуск";
			ОписаниеВидаВремени.БуквенныйКод = "ОД";
			ОписаниеВидаВремени.ЦифровойКод = "10";
			ОписаниеВидаВремени.ПолноеНаименование = НСтр("ru = 'Дополнительный отпуск'");
			ОписаниеВидаВремени.РабочееВремя = Ложь;
			ОписаниеВидаВремени.Целосменное = Истина;
			
			НовыйВидИспользованияРабочегоВремени(ОписаниеВидаВремени);
			
			ОписаниеВидаВремени = СоздатьОписаниеВидаВремени();
			ОписаниеВидаВремени.ИмяПредопределенныхДанных = "ОтпускПоБеременностиИРодам";
			// Строка не локализуется т.к. является частью регламентированной формы, применяемой в РФ
			ОписаниеВидаВремени.Наименование = "Отпуск по беременности и родам";
			ОписаниеВидаВремени.БуквенныйКод = "Р";
			ОписаниеВидаВремени.ЦифровойКод = "14";
			ОписаниеВидаВремени.ПолноеНаименование = НСтр("ru = 'Отпуск по беременности и родам'");
			ОписаниеВидаВремени.РабочееВремя = Ложь;
			ОписаниеВидаВремени.Целосменное = Ложь;
			
			НовыйВидИспользованияРабочегоВремени(ОписаниеВидаВремени);
			
			ОписаниеВидаВремени = СоздатьОписаниеВидаВремени();
			ОписаниеВидаВремени.ИмяПредопределенныхДанных = "Больничный";
			// Строка не локализуется т.к. является частью регламентированной формы, применяемой в РФ
			ОписаниеВидаВремени.Наименование = "Больничный";
			ОписаниеВидаВремени.БуквенныйКод = "Б";
			ОписаниеВидаВремени.ЦифровойКод = "19";
			ОписаниеВидаВремени.ПолноеНаименование = НСтр("ru = 'Временная нетрудоспособность с назначением пособия согласно законодательству'");
			ОписаниеВидаВремени.РабочееВремя = Ложь;
			ОписаниеВидаВремени.Целосменное = Истина;
			
			НовыйВидИспользованияРабочегоВремени(ОписаниеВидаВремени);
			
			ОписаниеВидаВремени = СоздатьОписаниеВидаВремени();
			ОписаниеВидаВремени.ИмяПредопределенныхДанных = "НеявкиПоНевыясненнымПричинам";
			// Строка не локализуется т.к. является частью регламентированной формы, применяемой в РФ
			ОписаниеВидаВремени.Наименование = "Неявки по невыясненным причинам";
			ОписаниеВидаВремени.БуквенныйКод = "НН";
			ОписаниеВидаВремени.ЦифровойКод = "30";
			ОписаниеВидаВремени.ПолноеНаименование = НСтр("ru = 'Неявки по невыясненным причинам'");
			ОписаниеВидаВремени.РабочееВремя = Ложь;
			ОписаниеВидаВремени.Целосменное = Ложь;
			
			НовыйВидИспользованияРабочегоВремени(ОписаниеВидаВремени);
			
			
			ОписаниеВидаВремени = СоздатьОписаниеВидаВремени();
			ОписаниеВидаВремени.ИмяПредопределенныхДанных = "ВыходныеДни";
			// Строка не локализуется т.к. является частью регламентированной формы, применяемой в РФ
			ОписаниеВидаВремени.Наименование = "Выходные дни";
			ОписаниеВидаВремени.БуквенныйКод = "В";
			ОписаниеВидаВремени.ЦифровойКод = "26";
			ОписаниеВидаВремени.ПолноеНаименование = НСтр("ru = 'Выходные дни (еженедельный отпуск) и  нерабочие праздничные дни'");
			ОписаниеВидаВремени.РабочееВремя = Ложь;
			ОписаниеВидаВремени.Целосменное = Истина;
			
			НовыйВидИспользованияРабочегоВремени(ОписаниеВидаВремени);
			
			ОписаниеВидаВремени = СоздатьОписаниеВидаВремени();
			ОписаниеВидаВремени.ИмяПредопределенныхДанных = "ОтпускПоУходуЗаРебенком";
			// Строка не локализуется т.к. является частью регламентированной формы, применяемой в РФ
			ОписаниеВидаВремени.Наименование = "Отпуск по уходу за ребенком";
			ОписаниеВидаВремени.БуквенныйКод = "ОЖ";
			ОписаниеВидаВремени.ЦифровойКод = "15";
			ОписаниеВидаВремени.ПолноеНаименование = НСтр("ru = 'Отпуск по уходу за ребенком'");
			ОписаниеВидаВремени.РабочееВремя = Ложь;
			ОписаниеВидаВремени.Целосменное = Истина;
			
			НовыйВидИспользованияРабочегоВремени(ОписаниеВидаВремени);
			
			ОписаниеВидаВремени = СоздатьОписаниеВидаВремени();
			ОписаниеВидаВремени.ИмяПредопределенныхДанных = "ОтпускНеоплачиваемыйСРазрешенияРаботодателя";
			// Строка не локализуется т.к. является частью регламентированной формы, применяемой в РФ
			ОписаниеВидаВремени.Наименование = "Отпуск неоплачиваемый с разрешения работодателя";
			ОписаниеВидаВремени.БуквенныйКод = "ДО";
			ОписаниеВидаВремени.ЦифровойКод = "16";
			ОписаниеВидаВремени.ПолноеНаименование = НСтр("ru = 'Отпуск неоплачиваемый с разрешения работодателя'");
			ОписаниеВидаВремени.РабочееВремя = Ложь;
			ОписаниеВидаВремени.Целосменное = Ложь;
			
			НовыйВидИспользованияРабочегоВремени(ОписаниеВидаВремени);
			
		ОписаниеВидаВремени = СоздатьОписаниеВидаВремени();
		ОписаниеВидаВремени.ИмяПредопределенныхДанных = "Прогул";
		// Строка не локализуется т.к. является частью регламентированной формы, применяемой в РФ
		ОписаниеВидаВремени.Наименование = "Прогул";
		ОписаниеВидаВремени.БуквенныйКод = "ПР";
		ОписаниеВидаВремени.ЦифровойКод = "24";
		ОписаниеВидаВремени.ПолноеНаименование = НСтр("ru = 'Прогул'");
		ОписаниеВидаВремени.РабочееВремя = Ложь;
		ОписаниеВидаВремени.Целосменное = Ложь;

		НовыйВидИспользованияРабочегоВремени(ОписаниеВидаВремени);
			
		Иначе
			Сообщить("Недостаточно прав!");
			
		КонецЕсли;
		
	КонецПроцедуры	
	
	Функция ПредопределенныйЭлемент(ПолноеИмяПредопределенного) Экспорт
		Возврат ПредопределенноеЗначение(ПолноеИмяПредопределенного);
	КонецФункции
	
	Функция СоздатьОписаниеВидаВремени()
		Возврат Новый Структура("ИмяПредопределенныхДанных, БуквенныйКод, БуквенныйКодБюджетный, БуквенныйКодБюджетный2009, Наименование, ЦифровойКод, ПолноеНаименование, РабочееВремя, Целосменное, ОсновноеВремя");	
	КонецФункции	
	
	Функция НовыйВидИспользованияРабочегоВремени(ОписаниеВидаВремени)
		
		ВидВремени = ПредопределенныйЭлемент("Справочник.ВидыИспользованияРабочегоВремени." + ОписаниеВидаВремени.ИмяПредопределенныхДанных);
		
		Если ЗначениеЗаполнено(ВидВремени) Тогда
			ВидВремениОбъект = ВидВремени.ПолучитьОбъект();
			ВидВремениСсылка = ВидВремениОбъект.Ссылка;
		Иначе	
			ВидВремениОбъект = Справочники.ВидыИспользованияРабочегоВремени.СоздатьЭлемент();
			ВидВремениСсылка = Справочники.ВидыИспользованияРабочегоВремени.ПолучитьСсылку();
			ВидВремениОбъект.УстановитьСсылкуНового(ВидВремениСсылка);
		КонецЕсли;		
		
		ЗаполнитьЗначенияСвойств(ВидВремениОбъект, ОписаниеВидаВремени);
		
		ВидВремениОбъект.Записать();
		
		Возврат ВидВремениОбъект;
		
	КонецФункции
	
	Процедура ОтключитьИспользованиеПредопределенногоЭлемента(ИмяПредопределенныхДанных)
		
		Ссылка = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыИспользованияРабочегоВремени." + ИмяПредопределенныхДанных);
		Если ЗначениеЗаполнено(Ссылка) Тогда
			Объект = Ссылка.ПолучитьОбъект();
			Попытка
				Объект.Заблокировать();
			Исключение
				ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("Невозможно изменить Виды использования рабочего времени ""%2"". Возможно, объект редактируется другим пользователем"), Объект.Наименование);
			КонецПопытки;
			Объект.НеИспользуется = Истина;
			Объект.Записать();
		Конецесли;
		
	КонецПроцедуры
	
#КонецЕсли
